---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.BoundaryConditions
source: html/a55d74ad-d5f1-4e4f-6224-facefde32556.htm
---
# BoundaryConditions Properties

The id of the assembly instance to which the element belongs.